app/controllers/schoolclasses_controller.rb

  def index
    @classes = Schoolclass.all
---
SELECT "schoolclasses".* FROM "schoolclasses"

  def show
    @c = Schoolclass.find(params[:id])
---
SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @c = Schoolclass.create(c_params)
---
INSERT INTO "schoolclasses" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Aces"], ["room_number", 2], ["created_at", "2018-11-05 21:42:57.734075"], ["updated_at", "2018-11-05 21:42:57.734075"]]

  def edit
    @c = Schoolclass.find(params[:id])
---
SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @c = Schoolclass.find(params[:id])
    @c.update(c_params)
---
SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "schoolclasses" SET "title" = ?, "updated_at" = ? WHERE "schoolclasses"."id" = ?  [["title", "Acessess"], ["updated_at", "2018-11-05 21:43:17.075542"], ["id", 1]]