app/controllers/students_controller.rb

  def update
    @student = Student.find(params[:id])
    @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "A"], ["updated_at", "2018-11-05 20:40:37.278694"], ["id", 4]]